Repository: elieasy333/hackathon1
Catalog: misc/About Me.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: no

source: GuideBook..title
no: Om meg

source: GuideBook..WelcomeMessageAbout Me..title
no: Om meg

source: GuideBook..WelcomeMessageAbout Me..Paragraph0
no: Dette eksempelet handler bare om deg – eller om det du vil! Så gjør deg klar til å dele noe spesielt, morsomt eller annerledes, samtidig som du lærer deg SwiftUI, slik at du kan vise informasjon i flere fanevisninger.

source: GuideBook..Guide0..StepAbout Me..title
no: Om meg

source: GuideBook..Guide0..StepAbout Me..LearningCenterContent..Paragraph1
no: ![](intro.png)

source: GuideBook..Guide0..StepAbout Me..LearningCenterContent..Paragraph2
no: Velkommen til Om meg-appen. I dette eksempelet lærer du det grunnleggende om hvordan du kan bruke [SwiftUI](glossary://SwiftUI) til å tilpasse innhold i en app med fire faner, som handler om … det du vil! Mens du utforsker dette eksempelet, kan du legge til innhold og prøve alle eksperimentene for å uttrykke deg i fanene.

source: GuideBook..Guide0..StepAbout Me..LearningCenterContent..Paragraph3
no: [Fane](doc://com.apple.documentation/documentation/swiftui/tabview)-visninger gjør det enklere å navigere i appen ved at brukerne kan se og bytte mellom flere visninger.

source: GuideBook..Guide0..StepAbout Me..LearningCenterContent..Paragraph4
no: Prøv å trykke på hver fane i appforhåndsvisningen: Hjem, Historie, Favoritter og Morsomme fakta.

source: GuideBook..Guide0..StepAbout Me..LearningCenterContent..GuideButtonStart Building..title
no: Begynn å bygge

source: GuideBook..Guide0..StepAbout Me..LearningCenterContent..GuideButtonStart Building..description
no: Tilgjengelighetsbeskrivelse for knapp

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..title
no: Hjem-fanen

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..title
no: Utforsk det grunnleggende i SwiftUI-kode

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..title
no: Hjem-fanen

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..Paragraph5
no: `HomeView` er den første fanen i appen, og det er denne fanen brukerne ser først når de åpner appen. Du så denne fanen den første gangen du åpnet prosjektet.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..Paragraph6
no: Du kan vise appen på to måter:

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..OrderedList0..Paragraph7
no: Trykk på Kjør-knappen (▶) i verktøylinjen øverst i Swift Playgrounds for å åpne appen. Trykk på Swift-symbolet og deretter Stopp for å gå tilbake til koden.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..OrderedList0..Paragraph8
no: Åpne filen AboutMeApp for å forhåndsvise appen din. Naviger tilbake til HomeView-filen for å gå tilbake til denne gjennomgangen og Hjem-forhåndsvisningen.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..Paragraph9
no: Før du tilpasser [brukergrensesnittet](glossary://user%20interface), som er hvordan appen ser ut, bør du ta en titt for å se hvordan det er laget.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..Paragraph10
no: Når du oppretter grensesnittet, bruker du [visninger](glossary://view), som er byggeklossene for appens brukergrensesnitt, for eksempel tekst, bilder og figurer. Visninger kan også fungere som beholdere, slik at du kan plassere en visning i en annen visning. I denne filen tilpasser du visningen `HomeView`, og den inneholder andre visninger, for eksempel `Text` og `Image`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..Paragraph11
no: Alle nye visninger må ha et [visningsinnhold](glossary://body) der du legger til alle visningene du vil vise. Siden visningen må vise noe, inneholder `body` alltid minst én visning. Her er tre vanlige visninger:

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..UnorderedList0..Paragraph12
no: [VStack](doc://com.apple.documentation/documentation/swiftui/vstack) er en visning som organiserer innholdet vertikalt fra øverst til nederst på skjermen.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..UnorderedList0..Paragraph13
no: [Text](doc://com.apple.documentation/documentation/swiftui/text) er en visning som viser en [streng](glossary://String). Husk å bruke anførselstegn rundt teksten i strengen.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..UnorderedList0..Paragraph14
no: [Image](doc://com.apple.documentation/documentation/swiftui/image) er en visning som viser et bilde, for eksempel PNG eller JPEG, eller symboler fra [SF-symboler](https://developer.apple.com/sf-symbols/).

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..Paragraph15
no: En annen ting du bør legge merke til, er [visningsmodifikatorer](glossary://modifier). De vises i lister under enkelte visninger. Visningsmodifikatorer endrer hvordan visningen ser ut og oppfører seg.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..Paragraph16
no: Når du modifiserer en visning, starter du på en ny linje under visningen og legger til koden, slik du ser her.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..Paragraph17
no: `Image` bruker to modifikatorer for å sørge for at bildet ser ut og oppfører seg som forventet:

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..UnorderedList1..Paragraph18
no: [resizable](doc://com.apple.documentation/documentation/swiftui/image/resizable(capinsets:resizingmode:)) gjør at bildet kan tilpasses plassen som er tilgjengelig på skjermen, ellers vises bildet i full størrelse, noe som kan være veldig stort. Med denne modifikatoren kan du også bruke andre modifikatorer på et bilde, for eksempel `scaledToFit`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..UnorderedList1..Paragraph19
no: [scaledToFit](doc://com.apple.documentation/documentation/swiftui/path/scaledtofit()) gir bildet beskjed om å beholde riktige proporsjoner for plassen som er tilgjengelig.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..TaskhomeView..PageHome Tab..Paragraph20
no: Fortsett for å begynne å tilpasse appen!

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..title
no: Tilpass Hjem-fanen

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..Page0..Paragraph21
no: Begynn med å bytte ut `Image` med et nytt bilde.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..Page0..Paragraph22
no: Slik legger du til ditt eget bilde på iPad:

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..Page0..OrderedList1..Paragraph23
no: Åpne venstre sidepanel.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..Page0..OrderedList1..Paragraph24
no: Trykk på Legg til fil-knappen øverst i sidepanelet.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..Page0..OrderedList1..Paragraph25
no: Trykk på Bilde for å legge til en bilderessurs fra Bilder-appen.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..Page0..OrderedList1..Paragraph26
no: Gi bildet et navn.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..Page0..OrderedList1..Paragraph27
no: Bytt ut navnet `Placeholder` i anførselstegn med navnet på bildet ditt.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..title
no: Tilpasse Hjem-fanen

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph28
no: OK, nå er det på tide å ha det litt gøy. Prøv disse modifikatorene, én om gangen, for å endre formen på bildet.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph29
no: Legg til en av disse modifikatorene under de andre bildemodifikatorene. Når du arbeider deg gjennom dem, kan du kommentere ut uønsket kode ved å skrive to skråstreker (`//`) i starten av linjen.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock0
no: .clipShape(Circle())

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock1
no: .clipShape(RoundedRectangle(cornerRadius: 10))

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock2
no: .clipShape(Ellipse())

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock3
no: .clipShape(Capsule())

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph30
no: Bruk den samme formen som bildet til å legge til en ramme rundt det ved hjelp av `overlay`-modifikatoren, som legger én visning foran en annen.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph31
no: Legg til denne koden under `clipShape`-modifikatoren.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock4
no: .overlay( Circle() .stroke(.yellow, style: StrokeStyle(lineWidth: 15)) )

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph32
no: Prøv å endre fargen eller `lineWidth` for overlegget.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph33
no: Nå som bildet er ferdig, oppdaterer du teksten under det. Visningen [Text](doc://com.apple.documentation/documentation/swiftui/text) er en annen [innebygd visning](glossary://built-in%20view) i SwiftUI.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph34
no: Endre `"Your Name"` til navnet eller tittelen på prosjektet ditt.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph35
no: Velg en fontstil for visningen `Text`. Bruk automatisk fullføring til å finne forskjellige fonter:

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..OrderedList2..Paragraph36
no: Slett `.title` (inkludert punktumet `.`).

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..OrderedList2..Paragraph37
no: Skriv et punktum (`.`) for å vise og velge blant de tilgjengelige valgene, for eksempel `caption` eller `largeTitle`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph38
no: Du kan bruke en tilpasset font i stedet for en standard fontstørrelse. Kommenter ut eller rediger modifikatoren `font`, så den ser slik ut:

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock5
no: .font(.custom(FontNames.helvetica, size: 40))

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph39
no: Slik viser du fontalternativene:

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..OrderedList3..Paragraph40
no: Slett `.helvetica`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..OrderedList3..Paragraph41
no: Skriv `.` for å vise og velge en ny font.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph42
no: Ta en titt på [System Fonts](https://developer.apple.com/fonts/system-fonts/) for å finne andre fonter, og legg dem deretter til i `FontNames` nederst i filen.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph43
no: Fortsett ved å legge til andre `Text`-visningsmodifikatorer!

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock6
no: .foregroundColor(.blue)

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock7
no: .padding(30)

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock8
no: .background(Color(red: 0.75, green: 0.75, blue: 0.75))

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock9
no: .cornerRadius(15)

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock10
no: .shadow(color: .blue, radius: 30)

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph44
no: Kombiner visninger og modifikatorer som bunker, SF-symboler og emojier, og husk å bruke farge, slik at navnet ditt stråler!

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph45
no: Prøv å legge til dette eksempelet på slutten av `VStack`. Behold delene du liker, og slett resten:

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock11
no: HStack { Image(systemName: "sparkles") .foregroundColor(.yellow) Text("Joyful") .font(.largeTitle) .foregroundColor(.mint) .padding() Image(systemName: "sparkles") .foregroundColor(.yellow) }

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph46
no: Du finner andre SF-symboler ved å åpne symbolbiblioteket (✪) i verktøylinjen for å se alle valgene dine.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph47
no: Gjør det enda morsommere ved å legge til en farge eller et mønster i bakgrunnen.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph48
no: Legg til denne modifikatoren under den høyre klammeparentesen (`}`) i `VStack` og `padding`-modifikatoren.

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..CodeBlock12
no: .background(Image("Blue"))

source: GuideBook..Guide0..StepAbout Me..TaskGroup0..Taskhome..PageCustomizing the Home Tab..Paragraph49
no: Nå kan du eksperimentere med alt du har lært hittil, for å tilpasse denne visningen!

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..title
no: Historie-fanen

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TaskstoryView..title
no: Lag en rullende historie

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TaskstoryView..PageCreate a scrolling narrative..title
no: Lag en rullende historie

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TaskstoryView..PageCreate a scrolling narrative..Paragraph50
no: Dette er `StoryView`, og her kan du vise en historie om hva du vil.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TaskstoryView..PageCreate a scrolling narrative..Paragraph51
no: Her finner du en del startkode som du kan utforske. Prøv å sveipe opp og ned i forhåndsvisningen for å se hvordan koden fungerer.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TaskstoryView..PageCreate a scrolling narrative..Paragraph52
no: Mens du sveipet opp eller ned, la du sannsynligvis merke til at visningen rullet! Denne [ScrollView](doc://com.apple.documentation/documentation/swiftui/scrollview) er en nyttig visning hvis du har mye innhold, for eksempel i en artikkel i en nyhetsapp. Med `ScrollView` kan brukeren rulle gjennom innholdet hvis det er lengre enn skjermen.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TaskstoryView..PageCreate a scrolling narrative..Paragraph53
no: En annen interessant del av denne siden er layouten og alle modifikatorene som gjør den mulig.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TaskstoryView..PageCreate a scrolling narrative..Paragraph54
no: Prøv å kommentere bort én modifikator om gangen for å se hvordan det påvirker hvordan visningen oppfører seg.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TaskstoryView..PageCreate a scrolling narrative..Paragraph55
no: Når du er klar, kan du fortsette for å lære nye måter å fange publikummets oppmerksomhet og gjøre historien levende på.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..title
no: Eksperimenter med forskjellige layouter og blikkfang

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..title
no: Eksperimenter med forskjellige layouter og blikkfang

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph56
no: Bruk en fengende tittel for å fange publikummets oppmerksomhet.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph57
no: Rediger startkoden ved å bytte ut `"Your Story"` med en fengende tittel. Bytt ut `"Your Name"` med navnet ditt.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph58
no: Bruk [Dividers](doc://com.apple.documentation/documentation/swiftui/divider) til å dele opp historien i avsnitt.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph59
no: Legg til denne koden under tekstvisningene og modifikatorene i `VStack`:

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..CodeBlock13
no: Divider()

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph60
no: Bruk mange skillelinjer i historien for å gi deler av den luft, og for å fremheve dem.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph61
no: Ta deg tid til å skrive historien din.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph62
no: Legg til disse visningene under skillelinjen, og rediger deretter teksten:

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..CodeBlock14
no: Text("Everyone knows that I just love …") .padding([.top, .bottom]) Text("My super power is …") .padding(.bottom)

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph63
no: Modifikatoren `.padding` er veldig nyttig for å sikre at det er nok plass rundt hvert element på siden. Legg merke til hvordan det brukes en [matrise](glossary://array) for å angi padding på bare to sider i en av padding-modifikatorene.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph64
no: Avhengig av hvor mye innhold du legger til, kan det hende du allerede har sett feilmeldingen «Ekstra argumenter ved posisjoner …» (eller kanskje du ser den snart). Dette er systemets måte å fortelle deg at du har mer enn ti visninger i en stabel på. SwiftUI liker ikke mer enn ti visninger som ikke er grupperte, så da må du gruppere ting!

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph65
no: Legg til `Group` rundt objekter som hører sammen, for eksempel tittelen på historien, navnet ditt og skillelinjen. Du finner et eksempel i det neste trinnet.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..CodeBlock15
no: Group { }

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph66
no: Når du grupperer objekter, får det ingen synlig påvirkning på brukergrensesnittet, men det kan hjelpe deg med å holde oversikten over forskjellige deler av historien. Derfor bør du tenke gjennom hvordan du grupperer objektene.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph67
no: Det påstås at et bilde sier mer enn tusen ord, så legg til noen bilder i historien din.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph68
no: Hvis du vil gjøre layouten mer dynamisk, kan du prøve å legge til `Image`- og `Text`-visninger i en `HStack`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph69
no: Legg til denne koden etter den siste gruppen med visninger i `VStack`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..CodeBlock16
no: Group { HStack { Text("In my life, I feel most grateful for …") Image("Placeholder") .resizable() .scaledToFit() .cornerRadius(15) } }

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph70
no: Prøv å bruke skillelinjer med tekst med forskjellige farger for å markere eller framheve viktige deler av historien.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph71
no: Legg til denne koden etter den siste gruppen med visninger i `VStack` for å prøve det.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..CodeBlock17
no: Group { Divider() Text("Get the most out of this section") .font(.title3) .foregroundColor(.cyan) Text("This is where you write something you really want to emphasize. The thing you want people to take away after reading your story.") .italic() Divider() }

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph72
no: Hvis du vil legge til en historie på denne fanen, legger du til en `VStack` i `ScrollView`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..CodeBlock18
no: VStack(alignment: .leading) { Group { Text("Another Story") .font(.largeTitle) Text("Author") .font(.subheadline) .foregroundColor(.secondary) Divider() } } .padding() .frame(maxWidth: .infinity) .background(in: RoundedRectangle(cornerRadius: 15)) .padding()

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph73
no: Kombiner nå alt for å gjøre historien levende.

source: GuideBook..Guide0..StepAbout Me..TaskGroup1..TasktrustYourVoice..PageExperiment with various layouts and attention grabbers..Paragraph74
no: Fortsett å legge til tekst, skillelinjer, bilder, bunker, grupper, farger, fonter og overskrifter for å gjøre historien mer dynamisk og interessant.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..title
no: Favoritter-fanen

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..title
no: Finn ut hvordan du kan vise favorittene dine på tre forskjellige måter

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..title
no: Favoritter-fanen
