Repository: elieasy333/hackathon1
Catalog: misc/About Me.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: no

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..Paragraph75
no: Denne fanen inneholder tre avsnitt med favoritter, som er organisert på en lignende måte. Det er en tittel øverst, en [HStack](doc://com.apple.documentation/documentation/swiftui/hstack) under, som viser bilder, tekst eller farger horisontalt, og en `Divider` som deler opp avsnittene.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..Paragraph76
no: Selv om mye av den samme koden brukes i alle avsnittene, er det også noen viktige forskjeller.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..Paragraph77
no: Bruk litt tid på å utforske koden for å se om du kan finne ut:

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..UnorderedList2..Paragraph78
no: Hvordan justeres tekst, bilder og farger til én side?

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..UnorderedList2..Paragraph79
no: Hvorfor kan du rulle maten fra side til side?

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..UnorderedList2..Paragraph80
no: Hvordan skjules fargene?

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..Paragraph81
no: Begynn med å se på hvordan tekst, bilder og farger er justert til én side.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..Paragraph82
no: Legg merke til at hvert avsnitt bruker en [HStack](doc://com.apple.documentation/documentation/swiftui/hstack) til å vise innhold og en [Spacer](doc://com.apple.documentation/documentation/swiftui/spacer) ved slutten, her …

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..Paragraph83
no: … og her …

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..Paragraph84
no: … og her …

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..Paragraph85
no: … og her! Som du ser, justeres visningene til den ene siden når du bruker en `HStack` og `Spacer`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..Paragraph86
no: Prøv å flytte `Spacer` til den første posisjonen i stabelen. Kan du gjette hva som skjer?

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskfavoritesView..PageFavorites Tab..Paragraph87
no: Fortsett for å finne svarene på de to andre spørsmålene mens du eksperimenterer med koden.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..title
no: Tilpass Favoritter-fanen

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..title
no: Favoritter-fanen

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph88
no: Begynn med å redigere koden for å vise yndlingshobbyene dine.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph89
no: Legg merke til at emojier bare er [strenger](glossary://String) med tekst! Derfor er det anførselstegn rundt emojien.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph90
no: Hvis du legger til mange hobbyer, kan du prøve å slette `Spacer` eller redigere avstanden i `HStack` for å se om du får plass til alle yndlingshobbyene dine på skjermen. Hvis du ikke får plass, kan det hende du finner en løsning i det neste avsnittet. 😉

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph91
no: Ser du hvorfor du kan rulle maten fra side til side?

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph92
no: Det stemmer! Den bruker en `ScrollView`. En `ScrollView` er vertikal som standard, men du kan få dem til å rulle horisontalt, slik du ser her.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph93
no: Bruk `ScrollView` ved å legge til flere av favorittrettene dine i listen, og se hva som skjer når objektene overskrider skjermbredden.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..CodeBlock19
no: Text("🍉") .font(.system(size: 48)) Text("🥖") .font(.system(size: 48)) Text("🍙") .font(.system(size: 48)) Text("🍫") .font(.system(size: 48)) Text("🥞") .font(.system(size: 48))

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph94
no: Nå skal du redigere matemojiene for å inkludere all favorittmaten din! 😋

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph95
no: Har du funnet ut hvordan fargene er skjult?

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph96
no: Hvis ikke, får du svaret her. Når du vil legge til innhold under en tittel, kan du bruke en `DisclosureGroup`, slik du ser her.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph97
no: Bytt ut fargene med favorittfargene dine!

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph98
no: Bytt ut fargene i koden med de fargene du vil. For å beholde den samme størrelsen og formen som de andre fargene i listen, må du ikke slette modifikatorene `frame` og `cornerRadius` under fargene.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph99
no: Du kan bruke SwiftUI-farger for å bytte fargene. Åpne fargebiblioteket (🎨) i verktøylinjen for å se alle valgene.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph100
no: Du kan også bruke RGB-farger (rødt, grønt, blått) slik:

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..CodeBlock20
no: Color(red: 0.6, green: 0.8, blue: 0.8)

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph101
no: Eller nyanser av grått:

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..CodeBlock21
no: Color(white: 0.7)

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph102
no: Eller HSB-verdier (nyanse, metning og lysstyrke) som definerer fargene:

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..CodeBlock22
no: Color(hue: 0.9, saturation: 0.5, brightness: 0.9)

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph103
no: Hvis du vil gi brukerne et hint om hva favorittfargen din er, kan du forandre tittelen ved hjelp av en `accentColor`-modifikator.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..Paragraph104
no: Legg til denne modifikatoren helt nederst i`DisclosureGroup`, under etiketten, klammeparentesen (`}`) og modifikatoren `.padding()`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup2..TaskbestBetter..PageFavorites Tab..CodeBlock23
no: .accentColor(.purple)

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..title
no: Morsomme fakta-fanen

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsView..title
no: Finn ut mer om knapper og status

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsView..PageFun Facts Tab..title
no: Morsomme fakta-fanen

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsView..PageFun Facts Tab..Paragraph105
no: I `FunFactsView` bruker du en [Button](doc://com.apple.documentation/documentation/swiftui/button) til å endre strengen for et interessant fakta når noen trykker på den.

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsView..PageFun Facts Tab..Paragraph106
no: Det er en knapp i `VStack`. Når du trykker på den, tildeler den et tilfeldig faktum fra matrisen `allFunFacts` til `funFact`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsView..PageFun Facts Tab..Paragraph107
no: `??` viser en forhåndsvalgt `String` hvis matrisen `allFunFacts` er tom.

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsView..PageFun Facts Tab..Paragraph108
no: Variabelen `funFact` er spesiell fordi den bruker en [statusegenskap](glossary://state%20property) som automatisk oppdaterer `Text`-visningen under med en ny verdi hver gang verdien for `funFact` endres.

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsView..PageFun Facts Tab..Paragraph109
no: Denne `Text`-visningen viser det morsomme faktumet. Den bruker variabelen `funFact` som [argument](glossary://argument), slik at den kan vise et nytt morsomt faktum hver gang verdien endres.

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..title
no: Som du vil

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..title
no: Morsomme fakta-fanen

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..Paragraph110
no: Begynn med å legge til mange interessante og morsomme fakta i matrisen `allFunFacts`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..Paragraph111
no: Bruk et komma på slutten av hver `String` for å vise at du starter et nytt objekt i matrisen.

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..Paragraph112
no: Denne siden ser bra ut, men du kan forbedre designen ved å legge til en bakgrunn. Det gjør du ved å bruke `ZStack` i koden for å legge til en `Image` under innholdet.

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..Paragraph113
no: Legg til en `Image` mellom `ZStack` og `VStack`, slik:

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..CodeBlock24
no: ZStack { Image("Green") VStack {

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..Paragraph114
no: Når du har valgt bakgrunnsfargen, er det tid for å jobbe med knappestilen.

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..Paragraph115
no: Prøv én, to eller alle disse knappemodifikatorene. Legg til denne modifikatoren under høyre klammeparentes (`}`) for `Button`.

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..CodeBlock25
no: .padding()

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..CodeBlock26
no: .foregroundColor(.white)

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..CodeBlock27
no: .background(.blue)

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..CodeBlock28
no: .clipShape(RoundedRectangle(cornerRadius: 15))

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..CodeBlock29
no: .shadow(radius: 15)

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..CodeBlock30
no: .font(.title2)

source: GuideBook..Guide0..StepAbout Me..TaskGroup3..TaskfunFactsExperiment..PageFun Facts Tab..Paragraph116
no: Du har brukt alle disse modifikatorene tidligere. De fleste modifikatorene fungerer i alle typer av `View`. Det er det som gjør SwiftUI til et så enkelt og effektivt verktøy!

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..title
no: Bruke og opprette faner

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskcontentView..title
no: Opprett et grensesnitt med faner

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskcontentView..PageTabbed Interface..title
no: Grensesnitt med faner

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskcontentView..PageTabbed Interface..Paragraph117
no: For å opprette et brukergrensesnitt med faner plasserer du visningene i en [TabView](doc://com.apple.documentation/documentation/swiftui/tabview), og deretter lister du opp hvert faneobjekt som du vil bruke i grensesnittet ditt.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskcontentView..PageTabbed Interface..Paragraph118
no: Du lager en fane ved å opprette en [instans](glossary://instance) av visningen du vil vise når noen trykker på en fane. Den første fanevisningen i listen er `HomeView`, så det er den første fanen du ser når appen åpnes.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskcontentView..PageTabbed Interface..Paragraph119
no: Når du har identifisert visningen du vil vise, i dette tilfellet `HomeView`, bruker du en `tabItem`-modifikator og overfører en `Label` som fanevisningen. Uten `tabItem` vil fanen for denne visningen være tom.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskcontentView..PageTabbed Interface..Paragraph120
no: Modifikatoren `tabItem` godtar bare visningene [Label](doc://com.apple.documentation/documentation/swiftui/label), [Text](doc://com.apple.documentation/documentation/swiftui/text) og [Image](doc://com.apple.documentation/documentation/swiftui/image). Hvis du inkluderer en annen visning, for eksempel [Button](doc://com.apple.documentation/documentation/swiftui/button), blir faneobjektet tomt.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskyourTab..title
no: Opprett din egen fane

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskyourTab..PageCreate Your Own Tab..title
no: Opprett din egen fane

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskyourTab..PageCreate Your Own Tab..Paragraph121
no: Nå skal du legge til din egen fane! Begynn med å oppdatere `YourTab`-filen. Lag brukergrensesnittet ditt ved hjelp av det du har lært, eller hent ideer fra andre prosjekter i appgalleriet!

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskyourTab..PageCreate Your Own Tab..Paragraph122
no: Uttrykk kreativiteten din her, og prøv deretter det neste eksperimentet for å legge til visningen din i fanelinjen.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..title
no: Legg til fanen din

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd Your Tab..title
no: Legg til fanen din

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd Your Tab..Paragraph123
no: Legg til en ny visning i `TabView` for å legge til den nye fanen.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd Your Tab..CodeBlock31
no: YourTab()

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..title
no: Legg til en fane

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..Paragraph124
no: Bruk deretter modifikatoren `tabItem` til gi visningen en `Label` som vises i listen med faner nederst i appen.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..CodeBlock32
no: .tabItem { Label("Your Tab", systemImage: "heart.fill") }

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..Paragraph125
no: Prøv den, slik at du ser at alt fungerer!

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..Paragraph126
no: Til slutt endrer du appens navn, appsymbol og aksentfarge! Det gjør du på følgende måte:

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..OrderedList4..Paragraph127
no: Åpne venstre sidepanel.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..OrderedList4..Paragraph128
no: Trykk på Appinnstillinger i øvre del av sidepanelet.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..OrderedList4..Paragraph129
no: Endre navnet på appen.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..OrderedList4..Paragraph130
no: Velg en aksentfarge.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..OrderedList4..Paragraph131
no: Trykk på Plassholder og velg et nytt symbol, eller trykk på Tilpasset for å laste opp ditt eget symbol.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..Paragraph132
no: Deretter kan du bruke forhåndsvisningen for å sjekke at navnet og faneetikettene har blitt oppdatert.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..Paragraph133
no: Hvis du bruker Mac, kan du også installere appen på datamaskinen i appinnstillingene!

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PageAdd a Tab..Paragraph134
no: Åpne Appinnstillinger igjen, rull helt ned, og klikk deretter på Installer på denne Macen for å teste appen din.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PagePolish..title
no: Polsk

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PagePolish..Paragraph135
no: Se gjennom alle fanene i appen, slik at alt ser riktig ut, og at du sier det du vil si. Be noen andre om å utforske appen din og komme med forslag til forbedringer.

source: GuideBook..Guide0..StepAbout Me..TaskGroup4..TaskaddATab..PagePolish..Paragraph136
no: Fortsett å utvikle SwiftUI-kunnskapene dine ved å ta en titt på noen av de andre prosjektene i appgalleriet.
